Tekla.Structures.Drawing.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.DPMPrinterAttributes,System.String)
Prints the drawing to file using the given printer attributes and name of the output file.
The given output file overrides the printer attributes file settings.
drawing: The drawing to be printed.
printAttributes: The print attributes for the print job.
outputFile: The print output file name.
Throws System.ArgumentException: Thrown if PDF printing selected, but no file name provided.
Throws System.ArgumentNullException: Thrown if drawing or printerAttributes is null.
Returns: True on success, false if printing fails.
Remarks: If there is an active drawing visible in the drawing editor and it is a
different drawing to the specified drawing, the active drawing will be closed.